salary = int(input('Введите вашу зароботную плату за месяц: '))    # Запрос и конвертация вводимых данных о зарплате в целые числа 
credit_payment = int(input('Введите сумму вашего платежа по кредиту: '))    # Запрос и конвертация вводимых данных о платеже по кредиту в целые числа
remains = salary - credit_payment    # Подсчет остатка денежных средств после уплаты кредитного платежа из заплаты
print(f'После выплаты кредитного платежа у вас останется: {remains}')    # Ввывод оставшихся средств после оплаты кредитного платежа


""" Все таки есть польза
 от бумажных носителей,
   благодаря товарищу
     Уолтеру Шилдлсу
 оценил пользу и необходимость
   оставлять комментарии. """