Number = int(input("Введите число: "))
if Number % 2 == 0:
    print(f"Число {Number} — чётное")
else:
    print(f"Число {Number} — нечётное")


    """ Синтаксические ошибки:
    - Одиночное равно, для сравнения нужно двойное
    - Не нужные отступы в начале строк перед if, else и print соответственно
    - Разные ковычки в последней строке 
    
        Логические ошибки:
    - Разный регистр в переменной, Number и number соответственно
    - тип вводимых данных в input, надо обернуть в целочисленные(int)
    - неверная операция, вместо сравнения % стоит умножение *
    - В строках вывода не хватает f, для вывода значения переменной,
      без неее выведет просто символы указанные в ковычках"""   
    