print('--- Программа учета количества пар в неделю --- ')
# Цикл while для запроса количества учебных дней в неделю
while True:
    try:
        study_days = int(input('Введите количество учебных дней в неделю (от 1 до 7): '))
        # Проверка вводимого диапозона количества дней, между 1 и 7
        if study_days < 1 or study_days > 7:
            print('Ошибка: Количество дней должно быть положительным числом, не превышающим 7!\n')
            continue # Возрат к циклу while, при неудачном вводе
        else:
            break # Ввод корректен, выход из цикла
    except ValueError:
        print('Ошибка: Введено не целое число или буквы! Вводите только цифры.\n')
print(f'\nУказано учебных дней: {study_days}. Введите количество пар для каждого дня.')
many_pairs = 0 # Инициализация переменной для общего подсчета пар за неделю
for number_day in range(1, study_days + 1): # Цикл с счетчиком for для перебора учебных дней по порядку от 1 до 7
# Вложенный цикл while True внутри цикла for.
    while True:
        try:
            pairs = int(input(f'Введите количество пар для выбранного дня {number_day}: '))
            if pairs < 0 or pairs > 7: # Проверка диапозона количества пар от 1 до 7( в условиях не требуется, но сделал исходя из простой логики)
                print('Ошибка: Количество пар не может быть числом отрицательным или превышать 7!\n')
                continue # Возрат к циклу while, при неудачном вводе
            else:
                many_pairs += pairs
                break # Ввод корректен, выход из цикла

        except ValueError:
            print('Ошибка: Введено не целое число или буквы! Вводите только цифры.\n ')

# Вывод итогового результата
print(f'\nОбщее количество учебных пар в неделю: {many_pairs}')
                        
