tuple = (23, 4, 12, 63, 51)  # Кортеж с индификаторами занятых ячеек постомата
while True:
    try:
        number = int(
            input("Введите номер ячейки постамата (от 1 до 5): ")
        )  # Запрос ввода и превращение его в целое число
        if number <= 0:  # Проверка числа, не должно быть отрицательным или равно
            print("Номер ячейки не может быть отрицательным или равным нулю. ")
        else:
            index = number - 1  # Если число подходит то переводим его в индекс

            if index < len(tuple):
                print(f"У ячейки номер {number} индификационный номер {tuple[index]}")
                break
            else:
                print(f"Запрос отклонен, ячейки с номером {number} не существует!!!")
    except ValueError:  # Обработчик ошибок при не правильном вводе.
        print("Ошибка! Вводите только только целые положительные числа.")
