print('--- Программа вывода чисел в порядке убывания ---')
print('Необходимо ввести два целых числа A и B. Требование: число A должно быть строго меньше B.\n')
while True:    # Цикл для проверки корректности ввода
    try:
        # Получение данных и их конвертация в целые числа
        A = int(input('Введите целое число A: '))
        B = int(input('Введите целое число B: '))
        # Проверка логики задачи if-else
        if A >= B:
            print('Ошибка: Число A должно быть строго меньше B! Поробуйте снова.\n')
            continue    # Переход к началу цикла while
        else:
            break    # Выход из цикла, если проверка выдала False

    except ValueError:
        print('Ошибка: ВЫ ввели не целое число! Используйте только целые числа и цифры:\n')

print('\n---Результаты расчетов ---')
print(f'Целые числа от {B} до {A} в порядке убывания:')

N = 0    # Инициализация переменной-счетчика

# Цикл с счетчиком for in и диапfзоном range(start, end, step)
for counter in range(B, A -1, -1):
    print(counter, end=' ')    # Вывод текущего числа через пробел, в строчку
    N += 1    # Увеличение на каждой итерации N на 1

print(f'\nКоличество выведенныз чисел (N): {N}')